export const NEWS = [
    {
        id: 301,
        title: 'Житомирська політехніка відкрила Центр цифрових інновацій',
        summary: 'Новий центр сприятиме розвитку IT-освіти та стартапів у регіоні.',
        body: 'У Житомирській політехніці урочисто відкрили Центр цифрових інновацій, створений у партнерстві з провідними IT-компаніями України. Центр працюватиме над проєктами з кібербезпеки, штучного інтелекту та big data, а також допомагатиме студентам реалізовувати власні стартапи. У рамках відкриття відбулися воркшопи з фахівцями EPAM, SoftServe і GlobalLogic.',
        date: '2025-09-30',
        featured: true,
        image: '/src/assets/news/news301.jpg'
    },

    {
        id: 302,
        title: 'Політехніка увійшла до ТОП-10 технічних університетів України',
        summary: 'Рейтинг складено за результатами вступної кампанії та наукової активності.',
        body: 'Згідно з новим національним рейтингом, Житомирська політехніка посіла 9-те місце серед технічних університетів України. Високі оцінки отримали програми з кібербезпеки, інформаційних технологій та менеджменту. Кількість заяв абітурієнтів на ІТ-спеціальності зросла на 18% порівняно з минулим роком.',
        date: '2025-08-20',
        image: '/src/assets/news/news302.jpg'
    },
    {
        id: 303,
        title: 'В університеті пройшов тиждень академічної доброчесності',
        summary: 'Студенти та викладачі обговорили культуру чесного навчання.',
        body: 'Протягом п’яти днів у Житомирській політехніці тривали лекції, дебати та тренінги, присвячені академічній доброчесності. Учасники дізналися про етичні стандарти у науковій роботі, уникнення плагіату та роль технологій у виявленні порушень. Захід завершився підписанням оновленого Кодексу честі університету.',
        date: '2025-07-15',
        image: '/src/assets/news/news304.jpg'
    },

]


export const findNewsById = (id) => NEWS.find(n => Number(n.id) === Number(id))
